[
  {
    "case": "While dining at a local restaurant, I bit into a piece of glass that was mixed in with my food. I suffered severe injuries to my mouth and had to undergo dental treatment. The restaurant staff were unapologetic and refused to take responsibility for the incident.",
    "grade": 7
  },
  {
    "case": "I was fired from my job after reporting sexual harassment by a coworker to the HR department. The company accused me of making false allegations and terminated my employment without conducting a proper investigation.",
    "grade": 9
  },
  {
    "case": "My neighbor's dog escaped from their yard and attacked me while I was walking down the street. I sustained severe injuries, including multiple bites and scratches. The dog's owner denies responsibility, claiming that I provoked the attack.",
    "grade": 8
  },
  {
    "case": "I purchased a used car from a dealership that falsely advertised the car's history and condition. After purchasing the car, I discovered it had been in a major accident and suffered from numerous mechanical issues. The dealership refuses to take any responsibility.",
    "grade": 7
  },
  {
    "case": "I rented an apartment that was infested with mold, which the landlord failed to disclose. As a result, I developed respiratory issues and had to seek medical treatment. The landlord has refused to address the mold problem or compensate me for my medical expenses.",
    "grade": 8
  },
  {
    "case": "I invested in a company based on the recommendation of a financial advisor who falsely claimed to have insider information about an upcoming merger. As a result, I suffered significant financial losses when the stock price plummeted.",
    "grade": 4
  },
  {
    "case": "During a cosmetic surgery procedure, the surgeon made a mistake, leaving me with permanent disfigurement. The surgeon claims that the results are within the range of acceptable outcomes and refuses to take responsibility.",
    "grade": 7
  },
  {
    "case": "I slipped and fell in a grocery store due to a wet floor with no warning signs. I suffered a concussion and a fractured hip. The store management denies any responsibility, claiming that they were not aware of the wet floor.",
    "grade": 6
  },
  {
    "case": "My employer failed to pay me overtime wages for working more than 40 hours per week. They claim that my position is exempt from overtime pay, but my job duties do not meet the criteria for exemption.",
    "grade": 8
  },
  {
    "case": "I discovered that my personal information was leaked by a major corporation due to a data breach, resulting in identity theft and financial losses. The corporation has not offered any compensation to affected customers.",
    "grade": 6
  },
  {
    "case": "I hired a contractor to renovate my home, but they failed to complete the work as agreed, leaving my home in disrepair. The contractor refuses to refund my money or finish the job.",
    "grade": 7
  },
  {
    "case": "I was a pedestrian crossing the street when I was struck by a car that ran a red light. I suffered a broken leg and a concussion. The driver was found to be under the influence of alcohol and was arrested at the scene.",
    "grade": 10
  },
  {
    "case": "I purchased a defective product that caused an electrical fire in my home, resulting in significant property damage. The manufacturer is aware of the defect but has not issued a recall or offered any compensation.",
    "grade": 9
  },
  {
    "case": "I was injured at my workplace due to faulty equipment that my employer failed to maintain properly. As a result, I had to undergo surgery and was unable to work for several months. My employer denies responsibility, claiming that I misused the equipment.",
    "grade": 8
  },
  {
    "case": "I was the victim of a hit-and-run accident while riding my bicycle. The driver of the vehicle was later identified and arrested. I suffered multiple injuries, including a fractured collarbone and a concussion.",
    "grade": 9
  },
  {
    "case": "I received a prescription for medication from my doctor that caused severe side effects due to an undisclosed interaction with another medication I was taking. The doctor claims that the side effects were a rare occurrence and that they were not negligent.",
    "grade": 6
  },
  {
    "case": "A construction company working on a project near my property caused damage to my home's foundation. The company claims that the damage was pre-existing and refuses to take responsibility.",
    "grade": 7
  },
  {
    "case": "I was fired from my job for taking medical leave to care for my sick child. My employer claims that they were not aware of my child's illness and that I was terminated for poor job performance.",
    "grade": 7
  },
  {
    "case": "I was involved in a car accident in which the other driver was clearly at fault. However, their insurance company refuses to pay for the damages to my vehicle, claiming that I was partially responsible for the accident.",
    "grade": 8
  },
  {
    "case": "My ex-spouse violated the terms of our custody agreement by moving out of state with our children without my consent. They claim that the move was necessary for their job and that it is in the best interest of the children.",
    "grade": 7
  },
  {
    "case": "I purchased a home and later discovered that the seller had concealed significant structural damage during the sale process. The seller denies responsibility, claiming that they were unaware of the damage.",
    "grade": 8
  },
  {
    "case": "I was injured by a defective product that was recalled by the manufacturer after my accident. The manufacturer claims that I was using the product improperly and that my injuries were not a result of the defect.",
    "grade": 6
  },
  {
    "case": "I was a victim of a scam by a fraudulent investment company, resulting in significant financial losses. The individuals responsible for the scam have been arrested, but the company's assets have been frozen and it is unclear if I will be able to recover any of my losses.",
    "grade": 5
  },
  {
    "case": "I visited a store and tripped on a poorly maintained staircase. I suffered a sprained ankle and bruises. The store owner claims they were not aware of the staircase's poor condition and refuses to take responsibility.",
    "grade": 6
  },
  {
    "case": "My personal information was stolen during a data breach at my bank, resulting in fraudulent charges on my account. The bank has reimbursed me for the charges but has not offered any compensation for the stress and inconvenience caused by the breach.",
    "grade": 5
  },
  {
    "case": "I underwent a medical procedure and contracted a serious infection due to unsanitary conditions at the hospital. The hospital claims that the infection was an isolated incident and that they followed all necessary protocols.",
    "grade": 8
  },
  {
    "case": "I hired a moving company to transport my belongings to my new home, and several valuable items were damaged during the move. The moving company denies responsibility, claiming that the damage was a result of improper packing.",
    "grade": 5
  },
  {
    "case": "My landlord failed to make necessary repairs to my apartment, resulting in water damage and mold growth. The landlord claims that they were unaware of the issue and that I should have reported it sooner.",
    "grade": 7
  },
  {
    "case": "I was injured at a theme park when a ride malfunctioned. The theme park claims that I ignored safety warnings and that the accident was my fault.",
    "grade": 6
  },
  {
    "case": "I purchased a defective appliance that caused a small fire in my home. The manufacturer has issued a recall for the product but refuses to compensate me for the damages caused by the fire.",
    "grade": 7
  },
  {
    "case": "I was discriminated against at my workplace due to my religious beliefs. My employer denies any discrimination and claims that my job performance was the reason for my negative treatment.",
    "grade": 7
  },
  {
    "case": "My insurance company refuses to cover the cost of medical treatment for a pre-existing condition, despite the fact that I was not aware of the condition when I purchased the policy. The company claims that I failed to disclose the information during the application process.",
    "grade": 6
  },
  {
    "case": "I was involved in a car accident caused by a distracted driver who was texting while driving. The driver's insurance company is disputing the extent of my injuries and offering a low settlement amount.",
    "grade": 8
  },
  {
    "case": "My home was damaged by a construction company that was working on a project adjacent to my property. The company claims that the damage was caused by natural wear and tear and refuses to take responsibility.",
    "grade": 6
  },
  {
    "case": "I was denied a promotion at work due to my age. My employer claims that the decision was based on my job performance, not my age.",
    "grade": 7
  },
  {
    "case": "I was injured at a gym when a piece of exercise equipment malfunctioned. The gym claims that I was using the equipment improperly and that the accident was my fault.",
    "grade": 6
  },
  {
    "case": "I was a passenger in a rideshare vehicle that was involved in an accident caused by the driver's negligence. I suffered a whiplash injury and missed several days of work. The rideshare company is offering a low settlement amount.",
    "grade": 8
  },
  {
    "case": "I hired a contractor to build an addition to my home, but the work was substandard and did not pass inspection. The contractor refuses to fix the issues or refund my money, claiming that the problems are due to the age of my home.",
    "grade": 7
  },
  {
    "case": "I was bitten by a dog at a public park. The dog's owner claims that I provoked the attack and refuses to take responsibility for my injuries.",
    "grade": 6
  },
  {
    "case": "I was denied a job opportunity because of my race. The employer claims that the decision was based on my qualifications, not my race.",
    "grade": 7
  },
  {
    "case": "I purchased a home and later discovered that the previous owner had removed valuable fixtures and appliances before the sale, which were not disclosed in the contract. The previous owner denies responsibility, claiming that the items were not included in the sale.",
    "grade": 7
  },
  {
    "case": "I underwent a medical procedure that resulted in permanent nerve damage. The doctor claims that the damage was an unavoidable risk of the procedure and refuses to take responsibility.",
    "grade": 6
  },
  {
    "case": "I was injured at a hotel when I slipped on a wet floor near the pool area. The hotel claims that they had placed warning signs in the area and that the accident was my fault.",
    "grade": 5
  },
  {
    "case": "My child was injured at school due to the negligence of a teacher who failed to supervise the children properly. The school claims that the injury was a result of normal playground activity and refuses to take responsibility.",
    "grade": 7
  },
  {
    "case": "I was defrauded by an online seller who never delivered the goods I purchased. The seller has disappeared, and it is unclear if I will be able to recover any of my money.",
    "grade": 4
  },
  {
    "case": "I was fired from my job after taking time off to care for my disabled spouse. My employer claims that my termination was due to poor job performance and not related to my time off.",
    "grade": 7
  },
  {
    "case": "I purchased a car from a private seller who misrepresented the vehicle's condition. The seller refuses to refund my money or take responsibility for the misrepresentation.",
    "grade": 6
  },
  {
    "case": "I was injured at a concert when a stage prop fell on me. The concert venue claims that the accident was an unforeseeable event and refuses to take responsibility for my injuries.",
    "grade": 5
  }
]
